# 在编写函数中 的一些 "分治思想"
'''
将一个大问题   拆解为一个一个的小问题
    经典案例： 青蛙上台阶
    青蛙一次只能 跳1 或者2 台阶, 如果青蛙跳n 级台阶，有多少方法?
        1级  ->  1种方法
        2级  ->  2种方法
        3级  ->  3种方法(在第一级上跳两级到3， 在第二级上跳一集到3)
            所以就是1级 + 2级
        ....
        n级  n-1 级 + n-2 级
'''

### 汉诺塔游戏
def game(n,A,B,C):
    if n == 1:
        print(f"将第{n}个盘子{A} 移动 {C}")
        return 
    # 将n-1个盘子， 从A借助C到B

    game(n-1,A,B,C)
    #将第n个盘子，从A移动到C
    print(f'将{n}个盘子, 从{A}到{C}')
    # 将n-1个盘子从B借助A移动到C
    game(n-1,A,B,C)

game(3,'A','B','C')